MP/src/InformationRegisters/КартинкиИФайлы/КартинкиИФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КартинкиИФайлы</name>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСохранения</name>
    <comment>Дата сохранения данных объекта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерФайла</name>
    <comment>Исходный размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к файлу / картинке</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Данные</name>
    <comment>Хранилище данных картинки или файла</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеВоВнешнемФайле</name>
    <comment>Признак того, что данные храняться во внешнем файле</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Картинка</name>
    <comment>Признак того, что файл являеться картинкой</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектДляФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <comment>Идентификационная строка, разделяющая данные объекта</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

MP/src/InformationRegisters/КартинкиИФайлы/ManagerModule.bsl
Функция ДобавленаЗаписьВРегистрСведений(ТекОбъект, СтруктураОписанияОбъекта, ИдентификаторФайла = "") Экспорт
	
	СтруктураДанных = Новый Структура;
	// 1. Поллучаем предварительный идентикиатор
	
	Добавляем = 1; 
	ПодбираемИдентификатор = Истина;    
	
	ПостФикс = "";                 
	
	ПрефиксФайла = "";
	
	Если СтруктураОписанияОбъекта.Свойство("ПрефиксФайла") Тогда
		ПрефиксФайла = СтруктураОписанияОбъекта.ПрефиксФайла; 
	КонецЕсли;
	
	ПредварительныйИдентификатор = СокрЛП(ТекОбъект.ГУИД);    
	
	Префикс = "";
	Если СтрНайти(СтруктураОписанияОбъекта.ТипСодержимого, "image") > 0 Тогда
		// Картинка                  
		ВидФайла = "Картинка";  
		
		Префикс = "_" + ПрефиксФайла;     
		
		//Если ТекОбъект.СостояниеОсмотра = Перечисления.СостоянияОсмотра.НачатьОсмотр Тогда  
		//	Префикс = "_Осмотр";               
		//Иначе	                               
		//	Префикс = "_Ремонт";       
		//КонецЕсли;		
		
		ТипФайла = "image";     
		
	ИначеЕсли СтрНайти(СтруктураОписанияОбъекта.ТипСодержимого, "video") > 0 Тогда
		// Картинка                  
		ВидФайла = "Видео";    
		
		Префикс = "_Видео" + ?(ПрефиксФайла = "", "", Лев(ПрефиксФайла, 1));
		
		//Если ТекОбъект.СостояниеОсмотра = Перечисления.СостоянияОсмотра.НачатьОсмотр Тогда  
		//	Префикс = "_ВидеоО";               
		//Иначе	                               
		//	Префикс = "_ВидеоР";       
		//КонецЕсли;		
		
		ТипФайла = "video";      	

		
	ИначеЕсли СтрНайти(СтруктураОписанияОбъекта.ТипСодержимого, "audio") > 0 Тогда        
		ВидФайла = "Аудио";       
		
		Префикс = "_Аудио" + ?(ПрефиксФайла = "", "", Лев(ПрефиксФайла, 1));
		
		//Если ТекОбъект.СостояниеОсмотра = Перечисления.СостоянияОсмотра.НачатьОсмотр Тогда  
		//	Префикс = "_АудиоО";               
		//Иначе	                               
		//	Префикс = "_АудиоР";       
		//КонецЕсли;	
		//
		ТипФайла = "audio";
	КонецЕсли;
		
	
	ПредварительныйИдентификатор = ПредварительныйИдентификатор + Префикс;
    		
	
	НовыйИдентификатор = ПредварительныйИдентификатор;  
		
	Пока ПодбираемИдентификатор Цикл
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	КартинкиИФайлы.Идентификатор КАК ДанныеВоВнешнемФайле
		                      |ИЗ
		                      |	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
		                      |ГДЕ
		                      |	КартинкиИФайлы.Идентификатор = &ПредварительныйИдентификатор
		                      |	И КартинкиИФайлы.Объект = &Объект");
		Запрос.УстановитьПараметр("ПредварительныйИдентификатор", НовыйИдентификатор);
		Запрос.УстановитьПараметр("Объект", ТекОбъект);
		Если Запрос.Выполнить().Выгрузить().Количество()=0 Тогда
		//	НовыйИдентификатор = ПредварительныйИдентификатор;
			ПодбираемИдентификатор = Ложь;
			
	//		ПостФикс = Добавляем; 
		Иначе
			НовыйИдентификатор = ПредварительныйИдентификатор + "_" + Строка(Добавляем);  
			ПостФикс = "_" + Строка(Добавляем);
			
			Добавляем = Добавляем + 1;
		КонецЕсли;
	КонецЦикла;          
	
	СтруктураДанных.Вставить("НовыйИдентификатор", НовыйИдентификатор);
	
	
	// 2 Шаг. Получаем описание       
	
	Попытка
		ВремКаталог = КаталогвРеменныхФайлов();    
			
		ИмяФайла = НовыйИдентификатор + "." + СтруктураОписанияОбъекта.РасширениеФайла;
		Если ТипЗнч(ТекОбъект) = Тип("ДокументСсылка.ЗаказНаряд") Тогда    
			ИмяФайла ="ЗН_"+СокрЛП(ТекОбъект.Номер) + "_"+ ФОрмат(ТекОбъект.Дата,  "ДФ=""ггггММдд""");		
		//	Если ТекОбъект.СостояниеОсмотра = Перечисления.СостоянияОсмотра.НачатьОсмотр Тогда  
				ИмяФайла = ИмяФайла + Префикс + ПостФикс + "." + СтруктураОписанияОбъекта.РасширениеФайла;   
				
		//	КонецЕсли;	   
		//	
		//Иначе      	
		//	ИмяФайла = НовыйИдентификатор + ПостФикс + "." + СтруктураОписанияОбъекта.РасширениеФайла;
		КонецЕсли;	                         
		// Создаем врем файл из двоичнх данных
		
		ИмяВремФайла  = ВремКаталог + "ВремФайл." + СтруктураОписанияОбъекта.РасширениеФайла;
		СтруктураОписанияОбъекта.ДвоичныеДанные.Записать(ИмяВремФайла);    
		ВремФайл  = Новый Файл(ИмяВремФайла);      
		
		
		НаборЗаписей = РегистрыСведений.КартинкиИФайлы.СоздатьНаборЗаписей(); 
		НаборЗаписей.Записывать = Истина;
		НаборЗаписей.Отбор.Объект.Установить(ТекОбъект, Истина);
		НаборЗаписей.Отбор.Идентификатор.Установить(НовыйИдентификатор, Истина);       
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Объект =  ТекОбъект;      
		НоваяЗапись.Идентификатор =  НовыйИдентификатор;   
		НоваяЗапись.ИмяФайла = ИмяФайла; 
		НоваяЗапись.ДатаСохранения = ВремФайл.ПолучитьВремяИзменения();
		НоваяЗапись.РазмерФайла = ВремФайл.размер();    
		НоваяЗапись.Данные = Новый ХранилищеЗначения(СтруктураОписанияОбъекта.ДвоичныеДанные, Новый СжатиеДанных(1)) ;
		НоваяЗапись.ДанныеВоВнешнемФайле = Ложь;   
		НоваяЗапись.Картинка = СтрНайти(СтруктураОписанияОбъекта.ТипСодержимого, "image")> 0;      
		НоваяЗапись.ТипФайла = ТипФайла;     
		НоваяЗапись.GUID = ИмяФайла; 
		
		
		НаборЗаписей.Записать(Истина);   
		
		ИдентификаторФайла = НовыйИдентификатор;
		
		
		
		//УдалитьФайлы(ИмяВремФайла);
		 
		Возврат Истина;
	Исключение  
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;		
	КонецПопытки;
	
КонецФункции
